{
  "thumbnail": "https://books.toscrape.com/media/cache/58/e2/58e2097169e92a95d973da420ce7cc98.jpg",
  "title": "I Hate Fairyland, Vol. 1: Madly Ever After (I Hate Fairyland (Compilations) #1-5)",
  "price": "£29.17",
  "stockInfo": {
    "inStock": true,
    "quantity": "16",
    "availability": "In stock (16 available)"
  },
  "rate": "Two",
  "category": "Sequential Art",
  "productInfo": {
    "UPC": "8d4eefad7a2b3915",
    "Product Type": "Books",
    "Price (excl. tax)": "£29.17",
    "Price (incl. tax)": "£29.17",
    "Tax": "£0.00",
    "Availability": "In stock (16 available)",
    "Number of reviews": "0"
  },
  "description": "From superstar writer and artist Skottie Young (Rocket Raccoon, Wizard of OZ, Fortunately, The Milk), comes the first volume of an all-new series of adventure and mayhem. An Adventure Time/Alice in Wonderland-style epic that smashes it's cute little face against grown-up, Tank Girl/Deadpool-esque violent madness. Follow Gert, a forty year old woman stuck in a six year olds From superstar writer and artist Skottie Young (Rocket Raccoon, Wizard of OZ, Fortunately, The Milk), comes the first volume of an all-new series of adventure and mayhem. An Adventure Time/Alice in Wonderland-style epic that smashes it's cute little face against grown-up, Tank Girl/Deadpool-esque violent madness. Follow Gert, a forty year old woman stuck in a six year olds body who has been stuck in the magical world of Fairyland for nearly thirty years. Join her and her giant battle-axe on a delightfully blood soaked journey to see who will survive the girl who HATES FAIRYLAND. Collecting Issues #1-5 for only $9.99. \"Skottie Young is an Eisner Award-Winning, New York Times Bestselling cartoonist who has been making comics and children's books for over fifteen years. Books such as Rocket Raccoon, the Wizard of Oz graphic novels, Little Marvel and Fortunately, The Milk have made him a fan favorite, critically-aclaimed writer and artist. Jean-Francios Beaulieu is the colorist behind the award-winning Wizard of OZ graphic graphic novels and has worked with Skottie Young for over ten years. Nate Piekos is an award-winning letter and designer who has created some of the industry's most popular fons and has used them to letter comic books for Marvel, DC, Oni Press, Dark Horse and many more.\" ...more",
  "scrapedAt": "2025-06-19T02:34:31.628Z"
}