{
  "thumbnail": "https://books.toscrape.com/media/cache/9d/15/9d150a1d5832bb9e3b82bbc1541912d6.jpg",
  "title": "So You've Been Publicly Shamed",
  "price": "£12.23",
  "stockInfo": {
    "inStock": true,
    "quantity": "15",
    "availability": "In stock (15 available)"
  },
  "rate": "Two",
  "category": "Nonfiction",
  "productInfo": {
    "UPC": "1b33663ad7b95fd8",
    "Product Type": "Books",
    "Price (excl. tax)": "£12.23",
    "Price (incl. tax)": "£12.23",
    "Tax": "£0.00",
    "Availability": "In stock (15 available)",
    "Number of reviews": "0"
  },
  "description": "For the past three years, Jon Ronson has traveled the world meeting recipients of high-profile public shamings. The shamed are people like us, people who, say, made a joke on social media that came out badly or made a mistake at work. Once the transgression is revealed, collective outrage circles with the force of a hurricane and the next thing they know, they're being tor For the past three years, Jon Ronson has traveled the world meeting recipients of high-profile public shamings. The shamed are people like us, people who, say, made a joke on social media that came out badly or made a mistake at work. Once the transgression is revealed, collective outrage circles with the force of a hurricane and the next thing they know, they're being torn apart by an angry mob, jeered at, demonized, sometimes even fired from their job.A great renaissance of public shaming is sweeping our land. Justice has been democratized. The silent majority are getting a voice, but what are we doing with our voice? We are mercilessly finding people's faults. We are defining the boundaries of normality by ruining the lives of those outside it. We are using shame as a form of social control.Simultaneously powerful and hilarious in the way only Jon Ronson can be, So You've Been Publicly Shamed is a deeply honest book about modern life, full of eye-opening truths about the escalating war on human flaws and the very scary part we all play in it. ...more",
  "scrapedAt": "2025-06-19T02:36:25.311Z"
}