{
  "thumbnail": "https://books.toscrape.com/media/cache/5d/a5/5da545b9d44464af8b3d0a9511a050ca.jpg",
  "title": "Sorting the Beef from the Bull: The Science of Food Fraud Forensics",
  "price": "£44.74",
  "stockInfo": {
    "inStock": true,
    "quantity": "14",
    "availability": "In stock (14 available)"
  },
  "rate": "Four",
  "category": "Science",
  "productInfo": {
    "UPC": "3edcccc4f341fb1a",
    "Product Type": "Books",
    "Price (excl. tax)": "£44.74",
    "Price (incl. tax)": "£44.74",
    "Tax": "£0.00",
    "Availability": "In stock (14 available)",
    "Number of reviews": "0"
  },
  "description": "Horse meat in our burgers, melamine in our infant formula, artificial colors in our fish and fruit--as our urban lifestyle takes us farther away from our food sources, there are increasing opportunities for dishonesty, duplicity, and profit-making shortcuts. Food adulteration, motivated by money, is an issue that has spanned the globe throughout human history. Whether it's Horse meat in our burgers, melamine in our infant formula, artificial colors in our fish and fruit--as our urban lifestyle takes us farther away from our food sources, there are increasing opportunities for dishonesty, duplicity, and profit-making shortcuts. Food adulteration, motivated by money, is an issue that has spanned the globe throughout human history. Whether it's a matter of making a good quality oil stretch a bit further by adding a little extra \"something\" or labeling a food falsely to appeal to current consumer trends--it's all food fraud. Consumers may pay the ultimate costs for these crimes, with their health and, in some cases, their lives. So how do we sort the beef from the bull (or horse, as the case may be)?Illustrious analytical chemist Richard Evershed and science writer Nicola Temple explain the scientific tools and techniques that have revealed the century's biggest food fraud scams. They explore the arms race between scientists and adulterators as better techniques for detection spur more creative and sophisticated means of adulteration, and review the up-and-coming techniques and devices that will help the industry and consumers fight food fraud in the future. Engagingly written, SORTING THE BEEF FROM THE BULL lifts the lid on the forensics involved, and brings to light the full story of a fascinating and underreported world of applied science. ...more",
  "scrapedAt": "2025-06-19T02:39:09.126Z"
}