{
  "thumbnail": "https://books.toscrape.com/media/cache/61/1b/611b527ab7ecef530e3040c85f6602c3.jpg",
  "title": "The Art of War",
  "price": "£33.34",
  "stockInfo": {
    "inStock": true,
    "quantity": "15",
    "availability": "In stock (15 available)"
  },
  "rate": "Five",
  "category": "Default",
  "productInfo": {
    "UPC": "e7469e22b5bfb3e7",
    "Product Type": "Books",
    "Price (excl. tax)": "£33.34",
    "Price (incl. tax)": "£33.34",
    "Tax": "£0.00",
    "Availability": "In stock (15 available)",
    "Number of reviews": "0"
  },
  "description": "Conflict is an inevitable part of life, according to this ancient Chinese classic of strategy, but everything necessary to deal with conflict wisely, honorably, victoriously, is already present within us. Compiled more than two thousand years ago by a mysterious warrior-philosopher, The Art of War is still perhaps the most prestigious and influential book of strategy in t Conflict is an inevitable part of life, according to this ancient Chinese classic of strategy, but everything necessary to deal with conflict wisely, honorably, victoriously, is already present within us. Compiled more than two thousand years ago by a mysterious warrior-philosopher, The Art of War is still perhaps the most prestigious and influential book of strategy in the world, as eagerly studied in Asia by modern politicians and executives as it has been by military leaders since ancient times. As a study of the anatomy of organizations in conflict, The Art of War applies to competition and conflict in general, on every level from the interpersonal to the international. Its aim is invincibility, victory without battle, and unassailable strength through understanding the physics, politics, and psychology of conflict.(Original publication date was circa 500 BCE.)For an outstanding Kindle edition, please refer to The Art of War by Sun Tzu - Classic Collector's Edition (Shawn Conners, Barton Williams, Lionel Giles, Sian Kim) ...more",
  "scrapedAt": "2025-06-19T02:36:15.291Z"
}