{
  "thumbnail": "https://books.toscrape.com/media/cache/65/6e/656e79dfd4f8b6bf19ffde2c75ceda81.jpg",
  "title": "Untitled Collection: Sabbath Poems 2014",
  "price": "£14.27",
  "stockInfo": {
    "inStock": true,
    "quantity": "16",
    "availability": "In stock (16 available)"
  },
  "rate": "Four",
  "category": "Poetry",
  "productInfo": {
    "UPC": "657fe5ead67a7767",
    "Product Type": "Books",
    "Price (excl. tax)": "£14.27",
    "Price (incl. tax)": "£14.27",
    "Tax": "£0.00",
    "Availability": "In stock (16 available)",
    "Number of reviews": "0"
  },
  "description": "More than thirty-five years ago, when the weather allowed, Wendell Berry began spending his sabbaths outdoors, walking and wandering around familiar territory, seeking a deep intimacy only time could provide. These walks arranged themselves into poems and each year since he has completed a sequence dated by the year of its composition. Last year we collected the lot into a More than thirty-five years ago, when the weather allowed, Wendell Berry began spending his sabbaths outdoors, walking and wandering around familiar territory, seeking a deep intimacy only time could provide. These walks arranged themselves into poems and each year since he has completed a sequence dated by the year of its composition. Last year we collected the lot into a collection, This Day, the Sabbath Poems 1979-2013. This new sequence for the following year is one of the richest yet. This group provides a virtual syllabus for all of Mr. Berry’s cultural and agricultural work in concentrated form. Many of these poems are drawn from the view from a small porch in the woods, a place of stillness and reflection, a vantage point “of the one/life of the forest composed/of uncountable lives in countless/years each life coherent itself within/ the coherence, the great composure,/of all.” A new collection of Wendell Berry poems is always an occasion of joyful celebration and this one is especially so. ...more",
  "scrapedAt": "2025-06-19T02:32:58.908Z"
}